zhanzr/cy8ckit-demo/app/mtb_shared/abstraction-rtos/release-v1.13.0/source/COMPONENT_THREADX/cyabs_rtos_threadx.c
/***********************************************************************************************//**
 * \file cyabs_rtos_threadx.c
 *
 * \brief
 * Implementation for ThreadX abstraction
 *
 ***************************************************************************************************
 * \copyright
 * (c) 2019-2025, Infineon Technologies AG, or an affiliate of Infineon
 * Technologies AG.  SPDX-License-Identifier: Apache-2.0
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 **************************************************************************************************/

#include <cy_result.h>
#include <cy_utils.h>
#include <cyabs_rtos.h>
#include <tx_api.h>
#include <stdlib.h>
#include "cyabs_rtos_internal.h"
#if defined (CY_RTOS_IS_H1_DEVICE)
#include "cyabs_rtos_impl_h1.h"
#endif

#define WRAPPER_IDENT           (0xABCDEF01U)
#define MAX_QUEUE_MESSAGE_SIZE  (16)
#define ALL_EVENT_FLAGS         (0xFFFFFFFFU)
#define MILLISECONDS_PER_SECOND (1000)

static cy_rtos_error_t last_error;


//--------------------------------------------------------------------------------------------------
// convert_ms_to_ticks
//--------------------------------------------------------------------------------------------------
static cy_time_t convert_ms_to_ticks(cy_time_t timeout_ms)
{
    if (timeout_ms == CY_RTOS_NEVER_TIMEOUT)
    {
        return TX_WAIT_FOREVER;
    }
    else if (timeout_ms == 0)
    {
        return 0;
    }
    else
    {
        uint64_t ticks = (uint64_t)timeout_ms * (uint64_t)TX_TIMER_TICKS_PER_SECOND /
                         (uint64_t)MILLISECONDS_PER_SECOND;
        if (ticks == 0)
        {
            ticks = 1;
        }
        else if (ticks >= UINT32_MAX)
        {
            // if ticks if more than 32 bits, change ticks to max possible value that isn't
            // TX_WAIT_FOREVER.
            ticks = UINT32_MAX - 1;
        }
        return (cy_time_t)ticks;
    }
}


//--------------------------------------------------------------------------------------------------
// convert_ticks_to_ms
//--------------------------------------------------------------------------------------------------
static inline cy_time_t convert_ticks_to_ms(cy_time_t timeout_ticks)
{
    return (cy_time_t)((uint64_t)timeout_ticks * (uint64_t)MILLISECONDS_PER_SECOND /
                       (uint64_t)TX_TIMER_TICKS_PER_SECOND);
}


//--------------------------------------------------------------------------------------------------
// convert_error
//--------------------------------------------------------------------------------------------------
static inline cy_rslt_t convert_error(cy_rtos_error_t error)
{
    if (error != TX_SUCCESS)
    {
        last_error = error;
        return CY_RTOS_GENERAL_ERROR;
    }
    return CY_RSLT_SUCCESS;
}


/******************************************************
*                 Last Error
******************************************************/

//--------------------------------------------------------------------------------------------------
// cy_rtos_last_error
//--------------------------------------------------------------------------------------------------
cy_rtos_error_t cy_rtos_last_error(void)
{
    return last_error;
}


/******************************************************
*                 Threads
******************************************************/

typedef struct
{
    TX_THREAD thread;
    uint32_t  magic;
    void*     memptr;
} cy_thread_wrapper_t;


//--------------------------------------------------------------------------------------------------
// cy_rtos_create_thread
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_thread_create(cy_thread_t* thread, cy_thread_entry_fn_t entry_function,
                                const char* name, void* stack, uint32_t stack_size,
                                cy_thread_priority_t priority, cy_thread_arg_t arg)
{
    if (0 != (stack_size & CY_RTOS_ALIGNMENT_MASK))
    {
        return CY_RTOS_ALIGNMENT_ERROR;
    }
    if ((thread == NULL) || (stack_size < CY_RTOS_MIN_STACK_SIZE))
    {
        return CY_RTOS_BAD_PARAM;
    }

    if ((stack != NULL) && (0 != (((uint32_t)stack) & CY_RTOS_ALIGNMENT_MASK)))
    {
        return CY_RTOS_ALIGNMENT_ERROR;
    }

    size_t malloc_size = sizeof(cy_thread_wrapper_t);
    if (stack == NULL)
    {
        malloc_size += stack_size;
    }
    void* buffer = malloc(malloc_size);
    if (buffer == NULL)
    {
        return CY_RTOS_NO_MEMORY;
    }

    cy_thread_wrapper_t* wrapper_ptr;
    if (stack == NULL)
    {
        stack = buffer;
        // Have stack be in front of wrapper since stack size is 8-byte aligned.
        wrapper_ptr         = (cy_thread_wrapper_t*)((uint32_t)buffer + stack_size);
        wrapper_ptr->memptr = stack;
    }
    else
    {
        wrapper_ptr         = buffer;
        wrapper_ptr->memptr = NULL;
    }
    wrapper_ptr->magic = WRAPPER_IDENT;

    *thread = (cy_thread_t)wrapper_ptr;

    // Disable preemption-thresholding and time slicing
    cy_rtos_error_t tx_rslt = tx_thread_create(*thread, (CHAR*)name, entry_function, arg, stack,
                                               stack_size, priority, priority, TX_NO_TIME_SLICE,
                                               TX_AUTO_START);

    if (TX_SUCCESS != tx_rslt)
    {
        last_error = tx_rslt;
        free(buffer);
        return CY_RTOS_GENERAL_ERROR;
    }

    return CY_RSLT_SUCCESS;
}


//--------------------------------------------------------------------------------------------------
// cy_rtos_thread_exit
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_thread_exit(void)
{
    // No need to do anything before thread exit
    return CY_RSLT_SUCCESS;
}


//--------------------------------------------------------------------------------------------------
// cy_rtos_thread_terminate
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_thread_terminate(const cy_thread_t* thread)
{
    if (thread == NULL)
    {
        return CY_RTOS_BAD_PARAM;
    }

    return convert_error(tx_thread_terminate(*thread));
}


//--------------------------------------------------------------------------------------------------
// cy_rtos_thread_is_running
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_thread_is_running(const cy_thread_t* thread, bool* running)
{
    if ((thread == NULL) || (running == NULL))
    {
        return CY_RTOS_BAD_PARAM;
    }

    // Only true when the given thread is the current one
    *running = (*thread == tx_thread_identify());
    return CY_RSLT_SUCCESS;
}


//--------------------------------------------------------------------------------------------------
// cy_rtos_thread_get_state
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_thread_get_state(const cy_thread_t* thread, cy_thread_state_t* state)
{
    if ((thread == NULL) || (state == NULL))
    {
        return CY_RTOS_BAD_PARAM;
    }

    bool      running;
    cy_rslt_t rslt = cy_rtos_is_thread_running(thread, &running);
    if (CY_RSLT_SUCCESS != rslt)
    {
        return rslt;
    }
    else if (running)
    {
        *state = CY_THREAD_STATE_RUNNING;
        return CY_RSLT_SUCCESS;
    }

