zhanzr/cy8ckit-demo/app/mtb_shared/abstraction-rtos/release-v1.13.0/source/COMPONENT_THREADX/cyabs_rtos_threadx.c
    UINT            thread_state;
    cy_rtos_error_t tx_rslt = tx_thread_info_get(*thread, TX_NULL, &thread_state, TX_NULL, TX_NULL,
                                                 TX_NULL, TX_NULL, TX_NULL, TX_NULL);
    if (TX_SUCCESS != tx_rslt)
    {
        last_error = tx_rslt;
        return CY_RTOS_GENERAL_ERROR;
    }

    // Descriptions of these states are not given in the ThreadX user guide - these are best guesses
    // as to their meanings
    switch (thread_state)
    {
        case TX_READY:
            *state = CY_THREAD_STATE_READY;
            break;

        case TX_COMPLETED:
        case TX_TERMINATED:
            *state = CY_THREAD_STATE_TERMINATED;
            break;

        case TX_SUSPENDED:
        case TX_SLEEP:
        case TX_QUEUE_SUSP:
        case TX_SEMAPHORE_SUSP:
        case TX_MUTEX_SUSP:
        case TX_EVENT_FLAG: // Likely waiting for event flags to be set (tx_event_flags_get)
        case TX_BLOCK_MEMORY: // Likely waiting to allocate a memory block (tx_block_allocate)
        case TX_BYTE_MEMORY: // Likely waiting to allocate a byte pool (tx_byte_allocate)
            *state = CY_THREAD_STATE_BLOCKED;
            break;

        default:
            *state = CY_THREAD_STATE_UNKNOWN;
            break;
    }

    return CY_RSLT_SUCCESS;
}


//--------------------------------------------------------------------------------------------------
// cy_rtos_thread_join
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_thread_join(cy_thread_t* thread)
{
    if (thread == NULL)
    {
        return CY_RTOS_BAD_PARAM;
    }

    // ThreadX doesn't have a join method itself, so just repeatedly check the thread's state until
    // it completes or is terminated.
    // Check if the thread we are joining has a higher priority, if it does, we need to lower our
    // priority to that of the other thread.
    UINT thread_state;

    cy_rtos_error_t tx_rslt = tx_thread_info_get(*thread, TX_NULL, &thread_state, TX_NULL, TX_NULL,
                                                 TX_NULL, TX_NULL, TX_NULL, TX_NULL);
    if (TX_SUCCESS != tx_rslt)
    {
        last_error = tx_rslt;
        return CY_RTOS_GENERAL_ERROR;
    }

    while (TX_TERMINATED != thread_state && TX_COMPLETED != thread_state)
    {
        tx_rslt = tx_thread_sleep(1);
        if (TX_SUCCESS != tx_rslt)
        {
            last_error = tx_rslt;
            return CY_RTOS_GENERAL_ERROR;
        }

        tx_rslt = tx_thread_info_get(*thread, TX_NULL, &thread_state, TX_NULL, TX_NULL, TX_NULL,
                                     TX_NULL, TX_NULL, TX_NULL);
        if (TX_SUCCESS != tx_rslt)
        {
            last_error = tx_rslt;
            return CY_RTOS_GENERAL_ERROR;
        }
    }

    tx_rslt = tx_thread_delete(*thread);
    if (TX_SUCCESS != tx_rslt)
    {
        last_error = tx_rslt;
        return CY_RTOS_GENERAL_ERROR;
    }

    cy_thread_wrapper_t* wrapper_ptr = (cy_thread_wrapper_t*)(*thread);
    if (wrapper_ptr->magic == WRAPPER_IDENT)
    {
        if (wrapper_ptr->memptr != NULL)
        {
            free(wrapper_ptr->memptr);
        }
        else
        {
            free(wrapper_ptr);
        }
    }
    return CY_RSLT_SUCCESS;
}


//--------------------------------------------------------------------------------------------------
// cy_rtos_thread_get_handle
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_thread_get_handle(cy_thread_t* thread)
{
    if (thread == NULL)
    {
        return CY_RTOS_BAD_PARAM;
    }

    *thread = tx_thread_identify();
    return CY_RSLT_SUCCESS;
}


//--------------------------------------------------------------------------------------------------
// cy_rtos_thread_wait_notification
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_thread_wait_notification(cy_time_t timeout_ms)
{
    UINT ret;
    cy_rslt_t status = CY_RSLT_SUCCESS;

    ret = tx_thread_sleep(convert_ms_to_ticks(timeout_ms));
    /* Update the last known error status */
    last_error = (cy_rtos_error_t)ret;

    if (ret == TX_SUCCESS)
    {
        status = CY_RTOS_TIMEOUT;
    }
    else if (ret != TX_WAIT_ABORTED)
    {
        status = CY_RTOS_GENERAL_ERROR;
    }
    return status;
}


//--------------------------------------------------------------------------------------------------
// cy_rtos_thread_set_notification
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_thread_set_notification(const cy_thread_t* thread)
{
    if (thread == NULL)
    {
        return CY_RTOS_BAD_PARAM;
    }
    /* According to ThreadX user guide, this function allowed to
     * be called from ISR
     */
    return convert_error(tx_thread_wait_abort(*thread));
}


//--------------------------------------------------------------------------------------------------
// cy_rtos_thread_get_name
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_thread_get_name(const cy_thread_t* thread, const char** thread_name)
{
    char* temp_name;
    cy_rtos_error_t tx_rslt = tx_thread_info_get(*thread, &temp_name, TX_NULL, TX_NULL, TX_NULL,
                                                 TX_NULL,
                                                 TX_NULL, TX_NULL, TX_NULL);
    cy_rslt_t result = convert_error(tx_rslt);
    if (result == CY_RSLT_SUCCESS)
    {
        *thread_name = temp_name;
    }
    return result;
}


/******************************************************
*                 Scheduler
******************************************************/
static uint16_t _cy_rtos_suspend_count = 0;

//--------------------------------------------------------------------------------------------------
// cy_rtos_scheduler_suspend
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_scheduler_suspend(void)
{
    ++_cy_rtos_suspend_count;
    #if defined (CY_RTOS_IS_H1_DEVICE)
    if (_cy_rtos_suspend_count == 1)
    {
        tx_interrupt_control(TX_INT_DISABLE);
    }
    #else
    tx_interrupt_control(TX_INT_DISABLE);
    #endif
    return CY_RSLT_SUCCESS;
}


//--------------------------------------------------------------------------------------------------
// cy_rtos_scheduler_resume
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_scheduler_resume(void)
{
    cy_rslt_t status;
    if (_cy_rtos_suspend_count > 0)
    {
        if (_cy_rtos_suspend_count == 1)
        {
            tx_interrupt_control(TX_INT_ENABLE);
        }
        --_cy_rtos_suspend_count;
        status = CY_RSLT_SUCCESS;
    }
    else
    {
        status = CY_RTOS_BAD_PARAM;
    }

