zhanzr/cy8ckit-demo/app/mtb_shared/abstraction-rtos/release-v1.13.0/source/COMPONENT_THREADX/cyabs_rtos_threadx.c
    return status;
}


//--------------------------------------------------------------------------------------------------
// cy_rtos_scheduler_get_state
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_scheduler_get_state(cy_scheduler_state_t* state)
{
    cy_rslt_t status;
    if (state == NULL)
    {
        status = CY_RTOS_BAD_PARAM;
    }
    else
    {
        if (_cy_rtos_suspend_count > 0)
        {
            *state = CY_SCHEDULER_STATE_SUSPENDED;
        }
        else
        {
            // ThreadX scheduler is always running, if not suspended
            *state = CY_SCHEDULER_STATE_RUNNING;
        }
        status = CY_RSLT_SUCCESS;
    }
    return status;
}


/******************************************************
*                 Mutexes
******************************************************/

//--------------------------------------------------------------------------------------------------
// cy_rtos_mutex_init
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_mutex_init(cy_mutex_t* mutex, bool recursive)
{
    if (mutex == NULL)
    {
        return CY_RTOS_BAD_PARAM;
    }

    // Non recursive mutex is not supported by ThreadX. A recursive mutex is returned
    // even if a non-recursive mutex was requested. This is ok because in all the cases
    // where the behavior of the two types differs would have ended in a deadlock. So
    // the difference in behavior should not have a functional impact on application.
    CY_UNUSED_PARAMETER(recursive);
    return convert_error(tx_mutex_create(mutex, TX_NULL, TX_INHERIT));
}


//--------------------------------------------------------------------------------------------------
// cy_rtos_mutex_get
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_mutex_get(const cy_mutex_t* mutex, cy_time_t timeout_ms)
{
    if (mutex == NULL)
    {
        return CY_RTOS_BAD_PARAM;
    }

    cy_rtos_error_t tx_rslt = tx_mutex_get((cy_mutex_t*)mutex, convert_ms_to_ticks(timeout_ms));
    if (TX_NOT_AVAILABLE == tx_rslt)
    {
        return CY_RTOS_TIMEOUT;
    }
    else
    {
        return convert_error(tx_rslt);
    }
}


//--------------------------------------------------------------------------------------------------
// cy_rtos_mutex_set
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_mutex_set(const cy_mutex_t* mutex)
{
    if (mutex == NULL)
    {
        return CY_RTOS_BAD_PARAM;
    }

    return convert_error(tx_mutex_put((cy_mutex_t*)mutex));
}


CY_MISRA_DEVIATE_BLOCK_START("MISRA C-2012 Rule 8.13", 1,
                             "Public API signature in cyabs_rtos.h is non-const for cross-kernel compatibility; some kernels update handle state in deinit paths.");
//--------------------------------------------------------------------------------------------------
// cy_rtos_deinit_mutex
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_mutex_deinit(cy_mutex_t* mutex)
{
    if (mutex == NULL)
    {
        return CY_RTOS_BAD_PARAM;
    }

    return convert_error(tx_mutex_delete(mutex));
}


CY_MISRA_BLOCK_END("MISRA C-2012 Rule 8.13");


/******************************************************
*                 Semaphores
******************************************************/

//--------------------------------------------------------------------------------------------------
// cy_rtos_semaphore_init
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_semaphore_init(cy_semaphore_t* semaphore, uint32_t maxcount, uint32_t initcount)
{
    if (semaphore == NULL)
    {
        return CY_RTOS_BAD_PARAM;
    }
    semaphore->maxcount = maxcount;
    return convert_error(tx_semaphore_create(&(semaphore->tx_semaphore), TX_NULL, initcount));
}


//--------------------------------------------------------------------------------------------------
// cy_rtos_semaphore_get
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_semaphore_get(const cy_semaphore_t* semaphore, cy_time_t timeout_ms)
{
    // Based on documentation
    // http://www.ece.ualberta.ca/~cmpe490/documents/ghs/405/threadxug_g40c.pdf
    // pg 168 it specifies that the timeout must be zero when called from ISR.
    if ((semaphore == NULL) || (is_in_isr() && (timeout_ms != 0)))
    {
        return CY_RTOS_BAD_PARAM;
    }
    cy_rtos_error_t tx_rslt =
        tx_semaphore_get((TX_SEMAPHORE*)&(semaphore->tx_semaphore),
                         convert_ms_to_ticks(timeout_ms));
    if (TX_NO_INSTANCE == tx_rslt)
    {
        return CY_RTOS_TIMEOUT;
    }
    else
    {
        return convert_error(tx_rslt);
    }
}


//--------------------------------------------------------------------------------------------------
// cy_rtos_semaphore_set
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_semaphore_set(const cy_semaphore_t* semaphore)
{
    if (semaphore == NULL)
    {
        return CY_RTOS_BAD_PARAM;
    }
    return convert_error(tx_semaphore_ceiling_put((TX_SEMAPHORE*)&(semaphore->tx_semaphore),
                                                  semaphore->maxcount));
}


//--------------------------------------------------------------------------------------------------
// cy_rtos_semaphore_get_count
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_semaphore_get_count(const cy_semaphore_t* semaphore, size_t* count)
{
    if ((semaphore == NULL) || (count == NULL))
    {
        return CY_RTOS_BAD_PARAM;
    }
    return convert_error(tx_semaphore_info_get((TX_SEMAPHORE*)&(semaphore->tx_semaphore), TX_NULL,
                                               (ULONG*)count, TX_NULL, TX_NULL, TX_NULL));
}


