zhanzr/cy8ckit-demo/app/mtb_shared/abstraction-rtos/release-v1.13.0/source/COMPONENT_THREADX/cyabs_rtos_threadx.c
CY_MISRA_DEVIATE_BLOCK_START("MISRA C-2012 Rule 8.13", 1,
                             "Public API signature in cyabs_rtos.h is non-const for cross-kernel compatibility; some kernels update handle state in deinit paths.");
//--------------------------------------------------------------------------------------------------
// cy_rtos_semaphore_deinit
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_semaphore_deinit(cy_semaphore_t* semaphore)
{
    if (semaphore == NULL)
    {
        return CY_RTOS_BAD_PARAM;
    }
    return convert_error(tx_semaphore_delete(&(semaphore->tx_semaphore)));
}


CY_MISRA_BLOCK_END("MISRA C-2012 Rule 8.13");


/******************************************************
*                 Events
******************************************************/

//--------------------------------------------------------------------------------------------------
// cy_rtos_event_init
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_event_init(cy_event_t* event)
{
    if (event == NULL)
    {
        return CY_RTOS_BAD_PARAM;
    }

    return convert_error(tx_event_flags_create(event, TX_NULL));
}


//--------------------------------------------------------------------------------------------------
// cy_rtos_event_setbits
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_event_setbits(const cy_event_t* event, uint32_t bits)
{
    if (event == NULL)
    {
        return CY_RTOS_BAD_PARAM;
    }
    return convert_error(tx_event_flags_set((cy_event_t*)event, bits, TX_OR));
}


//--------------------------------------------------------------------------------------------------
// cy_rtos_event_clearbits
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_event_clearbits(const cy_event_t* event, uint32_t bits)
{
    if (event == NULL)
    {
        return CY_RTOS_BAD_PARAM;
    }

    return convert_error(tx_event_flags_set((cy_event_t*)event, ~bits, TX_AND));
}


//--------------------------------------------------------------------------------------------------
// cy_rtos_event_getbits
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_event_getbits(const cy_event_t* event, uint32_t* bits)
{
    if ((event == NULL) || (bits == NULL))
    {
        return CY_RTOS_BAD_PARAM;
    }

    cy_rtos_error_t tx_rslt = tx_event_flags_get((cy_event_t*)event, ALL_EVENT_FLAGS, TX_OR,
                                                 (ULONG*)bits, TX_NO_WAIT);
    if (TX_NO_EVENTS == tx_rslt) // If timeout error occur with ALL_EVENT_FLAGS and TX_OR, then no
                                 // flag is set
    {
        *bits = 0;
        return CY_RSLT_SUCCESS;
    }
    else
    {
        return convert_error(tx_rslt);
    }
}


//--------------------------------------------------------------------------------------------------
// cy_rtos_event_waitbits
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_event_waitbits(const cy_event_t* event, uint32_t* bits, bool clear, bool all,
                                 cy_time_t timeout_ms)
{
    UINT get_option;

    if ((event == NULL) || (bits == NULL))
    {
        return CY_RTOS_BAD_PARAM;
    }

    if (all)
    {
        get_option = clear ? TX_AND_CLEAR : TX_AND;
    }
    else
    {
        get_option = clear ? TX_OR_CLEAR : TX_OR;
    }

    cy_rtos_error_t tx_rslt =
        tx_event_flags_get((cy_event_t*)event, *bits, get_option, (ULONG*)bits,
                           convert_ms_to_ticks(timeout_ms));
    if (TX_NO_EVENTS == tx_rslt)
    {
        return CY_RTOS_TIMEOUT;
    }
    else
    {
        return convert_error(tx_rslt);
    }
}


CY_MISRA_DEVIATE_BLOCK_START("MISRA C-2012 Rule 8.13", 1,
                             "Public API signature in cyabs_rtos.h is non-const for cross-kernel compatibility; some kernels update handle state in deinit paths.");
//--------------------------------------------------------------------------------------------------
// cy_rtos_event_deinit
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_event_deinit(cy_event_t* event)
{
    if (event == NULL)
    {
        return CY_RTOS_BAD_PARAM;
    }

    return convert_error(tx_event_flags_delete(event));
}


CY_MISRA_BLOCK_END("MISRA C-2012 Rule 8.13");


/******************************************************
*                 Queues
******************************************************/

//--------------------------------------------------------------------------------------------------
// cy_rtos_queue_init
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_queue_init(cy_queue_t* queue, size_t length, size_t itemsize)
{
    // Valid message lengths are {1-ULONG, 2-ULONG, 4-ULONG, 8-ULONG, 16-ULONG}
    static const uint32_t BYTES_PER_QUEUE_WORD = sizeof(ULONG);

    if ((queue == NULL) || (itemsize == 0) ||
        (itemsize > BYTES_PER_QUEUE_WORD * MAX_QUEUE_MESSAGE_SIZE))
    {
        return CY_RTOS_BAD_PARAM;
    }

    // round message words to next power of 2 times word size.
    UINT message_words = 1;
    while (message_words * BYTES_PER_QUEUE_WORD < itemsize)
    {
        message_words <<= 1;
    }

    queue->itemsize = itemsize;
    ULONG queue_size = length * message_words * BYTES_PER_QUEUE_WORD;
    queue->mem = malloc(queue_size);
    if (queue->mem == NULL)
    {
        return CY_RTOS_NO_MEMORY;
    }

    cy_rtos_error_t tx_rslt = tx_queue_create(&(queue->tx_queue), TX_NULL, message_words,
                                              queue->mem, queue_size);
    if (TX_SUCCESS != tx_rslt)
    {
        last_error = tx_rslt;
        free(queue->mem);
        return CY_RTOS_GENERAL_ERROR;
    }

    return CY_RSLT_SUCCESS;
}


//--------------------------------------------------------------------------------------------------
// cy_rtos_queue_put
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_queue_put(const cy_queue_t* queue, const void* item_ptr, cy_time_t timeout_ms)
{
    if ((queue == NULL) || (item_ptr == NULL) || (is_in_isr() && (timeout_ms != 0)))
    {
        return CY_RTOS_BAD_PARAM;
    }

    cy_rtos_error_t tx_rslt = tx_queue_send((TX_QUEUE*)&(queue->tx_queue), (void*)item_ptr,
                                            convert_ms_to_ticks(timeout_ms));
    if (TX_QUEUE_FULL == tx_rslt)
    {
        return CY_RTOS_NO_MEMORY;
    }
    else
    {
        return convert_error(tx_rslt);
    }
}


//--------------------------------------------------------------------------------------------------
// cy_rtos_queue_get
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_queue_get(const cy_queue_t* queue, void* item_ptr, cy_time_t timeout_ms)
{
    ULONG buffer[MAX_QUEUE_MESSAGE_SIZE];
    if ((queue == NULL) || (item_ptr == NULL) || (is_in_isr() && (timeout_ms != 0)))
    {
        return CY_RTOS_BAD_PARAM;
    }

