zhanzr/cy8ckit-demo/app/mtb_shared/abstraction-rtos/release-v1.13.0/source/COMPONENT_THREADX/cyabs_rtos_threadx.c
    cy_rtos_error_t tx_rslt =
        tx_queue_receive((TX_QUEUE*)&(queue->tx_queue), buffer, convert_ms_to_ticks(timeout_ms));
    if (TX_QUEUE_EMPTY == tx_rslt)
    {
        return CY_RTOS_TIMEOUT;
    }
    else if (tx_rslt == TX_SUCCESS)
    {
        memcpy(item_ptr, (void*)buffer, queue->itemsize);
        return CY_RSLT_SUCCESS;
    }
    else
    {
        last_error = tx_rslt;
        return CY_RTOS_GENERAL_ERROR;
    }
}


//--------------------------------------------------------------------------------------------------
// cy_rtos_queue_count
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_queue_count(const cy_queue_t* queue, size_t* num_waiting)
{
    if ((queue == NULL) || (num_waiting == NULL))
    {
        return CY_RTOS_BAD_PARAM;
    }
    return convert_error(tx_queue_info_get((TX_QUEUE*)&(queue->tx_queue), TX_NULL,
                                           (ULONG*)num_waiting, TX_NULL, TX_NULL, TX_NULL,
                                           TX_NULL));
}


//--------------------------------------------------------------------------------------------------
// cy_rtos_queue_space
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_queue_space(const cy_queue_t* queue, size_t* num_spaces)
{
    if ((queue == NULL) || (num_spaces == NULL))
    {
        return CY_RTOS_BAD_PARAM;
    }
    return convert_error(tx_queue_info_get((TX_QUEUE*)&(queue->tx_queue), TX_NULL, TX_NULL,
                                           (ULONG*)num_spaces, TX_NULL, TX_NULL, TX_NULL));
}


//--------------------------------------------------------------------------------------------------
// cy_rtos_queue_reset
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_queue_reset(const cy_queue_t* queue)
{
    if (queue == NULL)
    {
        return CY_RTOS_BAD_PARAM;
    }
    return convert_error(tx_queue_flush((TX_QUEUE*)&(queue->tx_queue)));
}


CY_MISRA_DEVIATE_BLOCK_START("MISRA C-2012 Rule 8.13", 1,
                             "Public API signature in cyabs_rtos.h is non-const for cross-kernel compatibility; some kernels update handle state in deinit paths.");
//--------------------------------------------------------------------------------------------------
// cy_rtos_queue_deinit
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_queue_deinit(cy_queue_t* queue)
{
    if (queue == NULL)
    {
        return CY_RTOS_BAD_PARAM;
    }
    cy_rslt_t result = convert_error(tx_queue_delete(&(queue->tx_queue)));
    if (result == CY_RSLT_SUCCESS)
    {
        free(queue->mem);
    }
    return result;
}


CY_MISRA_BLOCK_END("MISRA C-2012 Rule 8.13");


/******************************************************
*                 Timers
******************************************************/

//--------------------------------------------------------------------------------------------------
// cy_rtos_timer_init
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_timer_init(cy_timer_t* timer, cy_timer_trigger_type_t type,
                             cy_timer_callback_t fun, cy_timer_callback_arg_t arg)
{
    if ((timer == NULL) || (fun == NULL))
    {
        return CY_RTOS_BAD_PARAM;
    }
    timer->oneshot = (type == CY_TIMER_TYPE_ONCE);
    // Use 1s here as default timeouts since these are going to get changed anyway
    return convert_error(tx_timer_create(&(timer->tx_timer), TX_NULL, fun, arg, 1, 1,
                                         TX_NO_ACTIVATE));
}


//--------------------------------------------------------------------------------------------------
// cy_rtos_timer_start
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_timer_start(const cy_timer_t* timer, cy_time_t num_ms)
{
    if (timer == NULL)
    {
        return CY_RTOS_BAD_PARAM;
    }
    ULONG     timer_ticks = convert_ms_to_ticks(num_ms);
    cy_rslt_t rslt        =
        convert_error(tx_timer_change((TX_TIMER*)&(timer->tx_timer), timer_ticks,
                                      timer->oneshot ? 0 : timer_ticks));
    if (CY_RSLT_SUCCESS != rslt)
    {
        return rslt;
    }
    return convert_error(tx_timer_activate((TX_TIMER*)&(timer->tx_timer)));
}


//--------------------------------------------------------------------------------------------------
// cy_rtos_timer_stop
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_timer_stop(const cy_timer_t* timer)
{
    if (timer == NULL)
    {
        return CY_RTOS_BAD_PARAM;
    }
    return convert_error(tx_timer_deactivate((TX_TIMER*)&(timer->tx_timer)));
}


//--------------------------------------------------------------------------------------------------
// cy_rtos_timer_is_running
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_timer_is_running(const cy_timer_t* timer, bool* state)
{
    if ((timer == NULL) || (state == NULL))
    {
        return CY_RTOS_BAD_PARAM;
    }

    UINT      active;
    cy_rslt_t rslt =
        convert_error(tx_timer_info_get((TX_TIMER*)&(timer->tx_timer), TX_NULL, &active, TX_NULL,
                                        TX_NULL, TX_NULL));
    if (CY_RSLT_SUCCESS == rslt)
    {
        *state = (active == TX_TRUE);
    }
    return rslt;
}


CY_MISRA_DEVIATE_BLOCK_START("MISRA C-2012 Rule 8.13", 1,
                             "Public API signature in cyabs_rtos.h is non-const for cross-kernel compatibility; some kernels update handle state in deinit paths.");
//--------------------------------------------------------------------------------------------------
// cy_rtos_timer_deinit
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_timer_deinit(cy_timer_t* timer)
{
    if (timer == NULL)
    {
        return CY_RTOS_BAD_PARAM;
    }
    return convert_error(tx_timer_delete(&(timer->tx_timer)));
}


CY_MISRA_BLOCK_END("MISRA C-2012 Rule 8.13");


/******************************************************
*                 Time
******************************************************/

//--------------------------------------------------------------------------------------------------
// cy_rtos_time_get
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_time_get(cy_time_t* tval)
{
    if (tval == NULL)
    {
        return CY_RTOS_BAD_PARAM;
    }

    *tval = convert_ticks_to_ms(tx_time_get());

    return CY_RSLT_SUCCESS;
}


//--------------------------------------------------------------------------------------------------
// cy_rtos_delay_milliseconds
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_delay_milliseconds(cy_time_t num_ms)
{
    cy_time_t ticks = convert_ms_to_ticks(num_ms);

    return convert_error(tx_thread_sleep(ticks));
}
